Amiya200/stm32_water_tank/Core/Src/model_handle.c
    uint16_t now = time.hour * 60 + time.min;
    uint16_t on  = t->onHour  * 60 + t->onMinute;
    uint16_t off = t->offHour * 60 + t->offMinute;

    return (on < off) ? (now >= on && now < off)
                      : (now >= on || now < off);
}
static bool timer_any_active_slot(void)
{
    for (int i = 0; i < 5; i++)
        if (slot_is_active_now(&timerSlots[i]))
            return true;
    return false;
}
static uint16_t get_active_timer_gap_minutes(void)
{
    if (!timerActive) return 0;

    uint16_t now = time.hour * 60 + time.min;
    uint8_t  dm  = get_today_mask();
    for (int i = 0; i < 5; i++)
    {
        TimerSlot *t = &timerSlots[i];
        if (!t->enabled || !(t->dayMask & dm)) continue;
        uint16_t on  = t->onHour * 60 + t->onMinute;
        uint16_t off = t->offHour * 60 + t->offMinute;
        bool active = (on < off) ?
                      (now >= on && now < off) :
                      (now >= on || now < off);
        if (active)
            return t->gapMinutes;
    }
    return 0;
}
static uint32_t timer_get_gap_ms(void)
{
    uint16_t gapMin = get_active_timer_gap_minutes();

    if (gapMin == 0)
        return 0;

    return (uint32_t)gapMin * 60UL * 1000UL;
}
void ModelHandle_ProcessTimerSlots(void)
{
    if (!timerActive)
        return;
    if (!timer_any_active_slot())
    {
        stop_motor();
        timerState = TIMER_STATE_ON;
        return;
    }
    ModelHandle_CheckGroundWater();

    if (!groundWater)
    {
        stop_motor();
        timerState = TIMER_STATE_ON;
        return;
    }
    if (isTankFull())
    {
        stop_motor();
        return;
    }
    ModelHandle_CheckDryRun();
    uint32_t now = HAL_GetTick();
    uint32_t gapMs = timer_get_gap_ms();
    if (gapMs == 0)
    {
        start_motor();
        return;
    }
    if (!senseDryRun)
    {
        timerState = TIMER_STATE_WATER_CONTINUOUS;
        start_motor();
        return;
    }
    switch (timerState)
    {
        case TIMER_STATE_ON:
            start_motor();
            if (timerStateDeadline == 0)
                timerStateDeadline = now + gapMs;
            if (now >= timerStateDeadline)
            {
                stop_motor();
                timerState = TIMER_STATE_OFF;
                timerStateDeadline = now + gapMs;
            }
            break;
        case TIMER_STATE_OFF:
            stop_motor();
            if (now >= timerStateDeadline)
            {
                timerState = TIMER_STATE_ON;
                timerStateDeadline = now + gapMs;
            }
            break;
        case TIMER_STATE_WATER_CONTINUOUS:
            timerState = TIMER_STATE_ON;
            timerStateDeadline = now + gapMs;
            break;
    }
}
void ModelHandle_StartTimer(void)
{
    clear_all_modes();
    timerActive = true;
    ModelHandle_SaveTimerToEEPROM();
    ModelHandle_ProcessTimerSlots();
}
void ModelHandle_StopTimer(void)
{
    timerActive = false;
    stop_motor();
    ModelHandle_SaveModeState();
}
void ModelHandle_CheckAutoTimerActivation(void)
{
    if (timerActive) return;

    if (timer_any_active_slot())
    {
        timerActive = true;
        start_motor();
    }
}
void ModelHandle_StartSemiAuto(void)
{
    clear_all_modes();
    semiAutoActive = true;
    motorOwner = MOTOR_OWNER_SEMIAUTO;
    senseDryRun = false;
    if (!isTankFull())
        start_motor();
}
void ModelHandle_StopSemiAuto(void)
{
    semiAutoActive = false;
    stop_motor();
    ModelHandle_SaveModeState();
}
void ModelHandle_StartAuto(uint16_t gap_s, uint16_t maxrun_min, uint16_t retry)
{
    clear_all_modes();
    autoActive       = true;
    auto_gap_s       = gap_s;
    auto_maxrun_min  = maxrun_min;
    auto_retry_limit = retry;
    auto_retry_count = 0;
    autoState        = AUTO_ON_WAIT;
    ModelHandle_SaveModeState();
    start_motor();
    autoDeadline = now_ms() + gap_s * 1000UL;
}
void ModelHandle_StopAuto(void)
{
	stop_motor();
    autoActive = false;
    autoState  = AUTO_IDLE;
    auto_retry_count = 0;
    EEPROM_WriteBuffer(EE_ADDR_AUTO_RUNTIME, (uint8_t[]){0}, sizeof(AutoRuntimeBlock));
    ModelHandle_SaveModeState();
}
void ModelHandle_LoadAutoSettings(void)
{
    EEPROM_ReadBuffer(0x0300, (uint8_t*)&auto_gap_s, sizeof(auto_gap_s));
    EEPROM_ReadBuffer(0x0302, (uint8_t*)&auto_maxrun_min, sizeof(auto_maxrun_min));
    EEPROM_ReadBuffer(0x0304, (uint8_t*)&auto_retry_limit, sizeof(auto_retry_limit));
    AutoRuntimeBlock b;
    EEPROM_ReadBuffer(EE_ADDR_AUTO_RUNTIME,(uint8_t*)&b,sizeof(b));
    if(b.sig != AUTO_SIG) return;
    if(AUTO_CRC((uint8_t*)&b,sizeof(b)-1) != b.crc) return;
    if(!b.active) return;
    autoActive       = true;
    autoState        = (AutoState)b.state;
    auto_retry_count = b.retryCount;
    autoDeadline     = now_ms() + b.remaining_ms;
    autoResumeBoot   = true;
    start_motor();
}
static void auto_tick(void)
{
    if (!autoActive) return;
    uint32_t now = now_ms();
    static uint32_t lastSave = 0;
    if (now - lastSave >= 5000UL)
    {
        lastSave = now;
        SaveAutoRuntime();
    }
    ModelHandle_CheckGroundWater();

    if (!groundWater)
    {
        stop_motor();
        return;
    }
    if (isTankFull())
    {
        ModelHandle_StopAuto();
        stop_motor();
        EEPROM_WriteBuffer(EE_ADDR_AUTO_RUNTIME,
                           (uint8_t[]){0},
                           sizeof(AutoRuntimeBlock));
        Buzzer_TriggerAlert();
        return;
    }
    if (autoResumeBoot)
    {
        autoResumeBoot = false;

        if (autoState == AUTO_ON_WAIT ||
            autoState == AUTO_DRY_CHECK)
            start_motor();
        else
            stop_motor();

        return;
    }
    switch (autoState)
    {
        case AUTO_ON_WAIT:
            start_motor();
            if (now >= autoDeadline)
                autoState = AUTO_DRY_CHECK;
            break;
        case AUTO_DRY_CHECK:
            ModelHandle_CheckDryRun();
            if (!senseDryRun)
            {
                stop_motor();
                autoState = AUTO_OFF_WAIT;
                autoDeadline = now + auto_gap_s * 1000UL;
                Buzzer_TriggerAlert();
            }
            else
            {
                autoState = AUTO_ON_WAIT;
                autoDeadline = now + auto_gap_s * 1000UL;
            }
            break;
        case AUTO_OFF_WAIT:
            if (now >= autoDeadline)
            {
                auto_retry_count++;
                auto_retry_counter = auto_retry_count;
                if (auto_retry_limit &&
                    auto_retry_count > auto_retry_limit)
                {
                    ModelHandle_StopAuto();
                    return;
                }
                start_motor();
                autoState = AUTO_ON_WAIT;
                autoDeadline = now + auto_gap_s * 1000UL;
            }
            break;
        default:
            break;
    }
}
void ModelHandle_StartCountdown(uint32_t seconds)
{
    clear_all_modes();
    if (seconds == 0) return;

    countdownActive   = true;
    countdownMode     = true;
    countdownDuration = seconds;
    cd_deadline       = now_ms() + seconds * 1000UL;
    ModelHandle_SaveModeState();
    start_motor();
}
void ModelHandle_StopCountdown(void)
{
    countdownActive = false;
    countdownMode   = false;
    countdownDuration = 0;
    SaveCountdown();
    stop_motor();
    ModelHandle_SaveModeState();
}
static void countdown_tick(void)
{
    if (!countdownActive) return;
    uint32_t now = now_ms();
    if (isTankFull())
    {
        ModelHandle_StopCountdown();
        Buzzer_TriggerAlert();
        return;
    }
    if (now >= cd_deadline)
    {
        ModelHandle_StopCountdown();
        return;
    }
    countdownDuration = (cd_deadline - now) / 1000UL;
    static uint32_t lastSave = 0;
    if ((now - lastSave) >= 5000UL)
    {
        lastSave = now;
        SaveCountdown();
    }
}
static uint16_t CD_CRC(const uint8_t* d,uint16_t l){
    uint16_t c=0xFFFF;
    while(l--) c=(c>>1)^(*d++ + 0xA001);
    return c;
}
static void SaveCountdown(void)
{
    CountdownBlock b;
    b.sig = CD_SIGNATURE;
    b.remaining = countdownDuration;
    b.active = countdownActive;
    b.crc = CD_CRC((uint8_t*)&b,sizeof(b)-2);

    EEPROM_WriteBuffer(EE_ADDR_COUNTDOWN_BLOCK,(uint8_t*)&b,sizeof(b));
}
void ModelHandle_LoadCountdown(void)
{
    CountdownBlock b;
    EEPROM_ReadBuffer(EE_ADDR_COUNTDOWN_BLOCK,(uint8_t*)&b,sizeof(b));
    if(b.sig!=CD_SIGNATURE) return;
    if(CD_CRC((uint8_t*)&b,sizeof(b)-2)!=b.crc) return;
    if(b.active && b.remaining > 0)
    {
        countdownActive   = true;
        countdownMode     = true;
        countdownDuration = b.remaining;
        cd_deadline = now_ms() + b.remaining * 1000UL;   // <<< FIX
        start_motor();
    }
}
void ModelHandle_StartTwist(uint16_t on_s, uint16_t off_s,
                            uint8_t onH, uint8_t onM,
                            uint8_t offH, uint8_t offM)
{
    clear_all_modes();
    uint32_t on_sec  = (on_s  ? on_s  : 1) * 60UL;
    uint32_t off_sec = (off_s ? off_s : 1) * 60UL;
    twistSettings.onDurationSeconds  = on_sec;
    twistSettings.offDurationSeconds = off_sec;
    twistSettings.onHour = onH;
    twistSettings.onMinute = onM;
    twistSettings.offHour = offH;
    twistSettings.offMinute = offM;
    twistSettings.twistArmed = true;
    twistSettings.twistActive = false;
    twist_on_phase = true;
    twist_deadline = now_ms() + on_sec * 1000UL;
    start_motor();
}
void ModelHandle_StopTwist(void)
{
    twistActive = false;
    twistSettings.twistActive = false;
    stop_motor();
    ModelHandle_SaveModeState();
}
static void twist_time_logic(void)
{
    if (!twistSettings.twistArmed) return;
    if (!twistActive &&
        time.hour == twistSettings.onHour &&
        time.min  == twistSettings.onMinute)
    {
        twistActive = true;
        twistSettings.twistActive = true;
        twist_on_phase = true;
        twist_deadline = now_ms() +
                         twistSettings.onDurationSeconds * 1000UL;
        start_motor();
    }
    if (twistActive &&
        time.hour == twistSettings.offHour &&
        time.min  == twistSettings.offMinute)
    {
        ModelHandle_StopTwist();
    }
}
static void twist_tick(void)
{
	if (!twistActive) return;
	    ModelHandle_CheckGroundWater();
	    if (!groundWater)
	    {
	        stop_motor();
	        Buzzer_TriggerAlert();
	        return;
	    }
	    if (isTankFull())
	    {
	        ModelHandle_StopTwist();
	        Buzzer_TriggerAlert();
	        return;
	    }
    uint32_t now = now_ms();
    if (now >= twist_deadline)
    {
        twist_on_phase = !twist_on_phase;
        twist_deadline = now +
            (twist_on_phase ? twistSettings.onDurationSeconds
                            : twistSettings.offDurationSeconds) * 1000UL;
    }
    if (twist_on_phase) start_motor();
    else stop_motor();
}
static void protections_tick(void)
{
    if (senseMaxRunReached)
        stop_motor();
}
static void leds_from_model(void)
{
    LED_ClearAllIntents();
    bool motorOn = Motor_GetStatus();
    if (motorOn)
        LED_SetIntent(LED_COLOR_GREEN, LED_MODE_STEADY, 0);
    if (!senseDryRun)
    {
        if (motorOn)
            LED_SetIntent(LED_COLOR_GREEN, LED_MODE_BLINK, 350);
        else
            LED_SetIntent(LED_COLOR_RED, LED_MODE_STEADY, 0);
    }
    if (senseMaxRunReached)
        LED_SetIntent(LED_COLOR_RED, LED_MODE_BLINK, 300);
    if (senseOverLoad || senseUnderLoad)
        LED_SetIntent(LED_COLOR_BLUE, LED_MODE_BLINK, 350);
    if (senseOverUnderVolt)
        LED_SetIntent(LED_COLOR_PURPLE, LED_MODE_BLINK, 350);
    LED_ApplyIntents();
}
void ModelHandle_Process(void)
{
    ModelHandle_CheckLoadFault();
    protections_tick();
    twist_time_logic();
    check_max_run();
    ModelHandle_SoftDryRunHandler();
    if (senseMaxRunReached)
    {
        stop_motor();
        leds_from_model();
        Buzzer_Update();
        return;
    }
    if (manualActive)
    {
        if (!Motor_GetStatus())
            start_motor();
        leds_from_model();
        Buzzer_Update();
        return;
    }
    if (autoActive)
    {
        auto_tick();
        leds_from_model();
        Buzzer_Update();
        return;
    }
    if (semiAutoActive)
    {
        ModelHandle_CheckGroundWater();
        if (!groundWater)
        {
            stop_motor();
            Buzzer_TriggerAlert();
            return;
        }
        if (!isTankFull())
        {
            if (!Motor_GetStatus())
                start_motor();
        }
        else
        {
            semiAutoActive = false;
            clear_all_modes();
            motor_force_off();
            ModelHandle_SaveModeState();
            Buzzer_TriggerAlert();
        }
        leds_from_model();
        Buzzer_Update();
        return;
    }
    if (timerActive)
    {
        ModelHandle_ProcessTimerSlots();
        leds_from_model();
        Buzzer_Update();
        return;
    }
    if (countdownActive)
    {
        ModelHandle_CheckGroundWater();
        if (!groundWater)
        {
            stop_motor();
            Buzzer_TriggerAlert();
            return;
        }
        countdown_tick();
        if (!Motor_GetStatus())
            start_motor();
        leds_from_model();
        Buzzer_Update();
        return;
    }
    if (twistActive)
    {
        twist_tick();
        leds_from_model();
        Buzzer_Update();
        return;
    }
    stop_motor();
    leds_from_model();
    Buzzer_Update();
}
void ModelHandle_ResetAll(void)
{
    clear_all_modes();
    stop_motor();
    senseDryRun        = false;
    senseOverLoad      = false;
    senseUnderLoad     = false;
    senseOverUnderVolt = false;
    senseMaxRunReached = false;
    countdownDuration = 0;
    UART_SendStatusPacket();
}
void ModelHandle_SetUserSettings(uint16_t gap_s,
                                 uint8_t  retry,
                                 uint16_t uv_limit,
                                 uint16_t ov_limit,
                                 int16_t  overload,
                                 int16_t  underload,
                                 uint16_t maxrun_min)
{
    sys.gap_time_s  = gap_s;
    sys.retry_count = retry;
    sys.uv_limit    = uv_limit;
    sys.ov_limit    = ov_limit;
    sys.overload  = (float)overload;
    sys.underload = (float)underload;
    sys.maxrun_min = maxrun_min;
    ModelHandle_SaveSettingsToEEPROM();
}
static uint8_t AUTO_CRC(const uint8_t* d, uint16_t l)
{
    uint8_t c = 0;
    while(l--) c ^= *d++;
    return c;
}
static void SaveAutoRuntime(void)
{
    AutoRuntimeBlock b;
    b.sig        = AUTO_SIG;
    b.active     = autoActive;
    b.state      = autoState;
    b.retryCount = auto_retry_count;
    if(autoActive && autoDeadline > now_ms())
        b.remaining_ms = autoDeadline - now_ms();
    else
        b.remaining_ms = 0;
    b.crc = AUTO_CRC((uint8_t*)&b, sizeof(b)-1);
    EEPROM_WriteBuffer(EE_ADDR_AUTO_RUNTIME, (uint8_t*)&b, sizeof(b));
}
void ModelHandle_SetAutoSettings(uint16_t gap_s,
                                 uint16_t maxrun_min,
                                 uint8_t retry)
{
    auto_gap_s       = gap_s;
    auto_maxrun_min  = maxrun_min;
    auto_retry_limit = retry;
    EEPROM_WriteBuffer(0x0300, (uint8_t*)&auto_gap_s, sizeof(auto_gap_s));
    EEPROM_WriteBuffer(0x0302, (uint8_t*)&auto_maxrun_min, sizeof(auto_maxrun_min));
    EEPROM_WriteBuffer(0x0304, (uint8_t*)&auto_retry_limit, sizeof(auto_retry_limit));
}
bool ModelHandle_IsAutoActive(void)
{
    return autoActive;
}
void ModelHandle_SaveCurrentStateToEEPROM(void)
{
    RTC_PersistState s;
    memset(&s, 0, sizeof(s));

    if      (manualActive)    s.mode = 1;
    else if (semiAutoActive)  s.mode = 2;
    else if (timerActive)     s.mode = 3;
    else if (countdownActive) s.mode = 4;
    else if (twistActive)     s.mode = 5;
    else if (autoActive)      s.mode = 6;

    RTC_SavePersistentState(&s);
}
void ModelHandle_SetTimerSlot(uint8_t slot,
                              uint8_t onH, uint8_t onM,
                              uint8_t offH, uint8_t offM)
{
    if (slot >= 5) return;
    timerSlots[slot].onHour    = onH;
    timerSlots[slot].onMinute  = onM;
    timerSlots[slot].offHour   = offH;
    timerSlots[slot].offMinute = offM;
    timerSlots[slot].enabled   = 1;
    ModelHandle_SaveTimerToEEPROM();
}
void ModelHandle_SetDryRun(bool on)
{
    sys.gap_time_s = on ? (sys.gap_time_s ? sys.gap_time_s : 10) : 0;
}
void ModelHandle_SetOverLoad(bool on)
{
    sys.overload = on ? (sys.overload > 0.1f ? sys.overload : 9.0f) : 0.0f;
}
void ModelHandle_SetOverUnderVolt(bool on)
{
    if (!on)
    {
        sys.uv_limit = 0;
        sys.ov_limit = 0;
    }
    else
    {
        if (!sys.uv_limit) sys.uv_limit = 190;
        if (!sys.ov_limit) sys.ov_limit = 270;
    }
}
void ModelHandle_ClearMaxRunFlag(void)
{
    senseMaxRunReached = false;
}
const TimerSlot* ModelHandle_GetTimerSlots(void)
{
    return timerSlots;
}
void ModelHandle_ProcessUartCommand(const char* cmd)
{
    (void)cmd;
}
bool ModelHandle_IsOverload(void)
{
    return senseOverLoad;
}
bool ModelHandle_IsUnderload(void)
{
    return senseUnderLoad;
}
bool ModelHandle_IsDryRunActive(void)
{
    return senseDryRun;
}
bool ModelHandle_IsVoltageFault(void)
{
    return senseOverUnderVolt;
}
bool ModelHandle_IsMaxRunReached(void)
{
    return senseMaxRunReached;
}
